Repository: fAntel/savepass
Catalog: localizing/*.po
Languages: ru

source: file {0} doesn't exists
ru: не существует файла {0}

source: reading file {0} failed: {1}
ru: ошибка при чтении файла {0}: {1}

source: wrong master password
ru: неверный мастер-пароль

source: there are no passwords in this file
ru: в этом файле нет паролей

source: there is no password with number {0} in this file
ru: в этом файле нет пароля с номером {0}

source: there is no notes containing "{0}" as a substring.
ru: нет комментария содержащего "{0}" в качестве подстроки

source: too much notes compare to "{0}". Try to refine your query.
ru: слишком много комментариев сравнимы с "{0}". Попробуйте уточнить запрос

source: configuration file {0} doesn't exists. If -S option used it will be created
ru: файл настроек {0} не существует. Если параметр -S используется, то он будет создан

source: openging configuration file {0} failed: {1}
ru: ошибка при открытии файла конфигурации {0}: {1}

source: creating object for default settings failed: {0}
ru: ошибка во время создания объекста для настроек по умолчанию: {0}

source: openging system configuration file {0} failed: {1}
ru: ошибка при открытии системного файла настроек {0}: {1}

source: openging user configuration file {0} failed: {1}
ru: ошибка при открытии пользовательского файла настроек {0}: {1}

source: saving default_file failed: {0}
ru: ошибка при сохранении настройки default_file: {0}

source: {0} (default)
ru: {0} (значение по умолчанию)

source: Usage: savepass [OPTIONS] FILE - password saver
ru: Использование: savepass [ПАРАМЕТРЫ] FILE - хранитель паролей

source: Options:
ru: Параметры:

source: Add new password to the list
ru: Добавить новый пароель в список

source: Change password with number {N}
ru: Изменить пароль с номером {N}

source: Delete password with number {N}
ru: Удалить пароль с номером {N}

source: Get password with number {N}
ru: Получить пароль с номером {N}

source: Get password on screen and not in the clipboard
ru: Получать пароль на экран, а не в буффер обмена

source: Get password with note {NOTE}
ru: Получить пароль с комментарием {NOTE}

source: Show list of passwords' notes
ru: Показать список комментариев к паролям

source: Show list of passwords' notes like {NOTE}
ru: Показать список комментариев к паролям похожих на {NOTE}

source: Set the default {FILE}
ru: Установить {файл} по умолчанию

source: Show version
ru: Показать версию

source: Show this text
ru: Показать этот текст

source: Settings options:
ru: Параметры настроек:

source: {*.conf} file with settings
ru: {*.conf} файл настроек

source: Set {mod} of --get option
ru: Установить {режим работы} параметра --get

source: Set {mod} of --change option
ru: Установить {режим работы} параметра --change

source: Show date and time when used --list and --search options
ru: Показывать дату и время когда используются параметры --list и --search

source: Set {format} for date and time output
ru: Установить {формат} вывода даты и времени

source: Save new settings passed via the command line
ru: Сохранить новые настройки переданные через параметры командной строки

source: Work with settings in system configuration file
ru: Работать с настройками из системного файла настроек

source: Show values of all/setted/system/user settings
ru: Показать all(все)/setted(установленные)/system(системные)/user(пользовательсткие) настройки

source: option parsing failed: {0} Try `{1} --help' for more information.
ru: ошибка обработки параметров командной строки: {0} Для получения информации по параметрам командной строки попробуйте '{1} --help'

source: too much options
ru: слишком много параметров командной строки

source: Enter password:
ru: Введите пароль:

source: Enter password again:
ru: Введите пароль снова:

source: Passwords doesn't match. Try again
ru: Пароле не совпадают. Попробуйте снова

source: Enter note:
ru: Введите комментарий:

source: Are you sure{0}? (y/n)
ru: Вы уверены{0}? (y/n)

source: Enter new password (if you press ENTER password will stay the same):
ru: Введите новый пароль (если нажмёте Enter, то пароль останется прежним):

source: Enter new password again:
ru: Введите новый пароль снова:

source: Enter new note [{0}]:
ru: Введите новый комментарий [{0}]:

source: wrong argument for config option
ru: неверный аргумент параметра командной строки

source: File name must be specified Try run {0} --help for more information
ru: Должно быть указано имя файла\nДля получения информации по параметрам командной строки попробуйте '{1} --help'

source: you want to delete password with note "{0}"
ru: вы хотите удалить пароль с комментарием "{0}"

source: password was deleted
ru: пароль был удалён

source: Passwords' notes:
ru: Комментарии к паролям:

source: date_time_format is invalid: {0}
ru: Формат даты/времени в настройке date_time_format неверен: {0}

source: Enter master password:
ru: Введите мастер-пароль:

source: string for search cannot be an empty string. If you want to see all passwords use --list
ru: строка для поиска не может быть пустой. Если вы хотите увидеть все пароли используйте --list

source: Passwords' notes contains "{0}":
ru: Комментарии к паролям содержащие "{0}":

source: string for search cannot be an empty string or cosists exclusively of white-space characters. If you want to see all passwords use --list
ru: строка для поиска не может быть пустой или содержать испключительно пробельные символы. Если вы хотите увидеть все пароли, то используйте --list
